{
  "backend/main.mo": "Main Motoko actor for the Pashu Mandi backend, defining data types and CRUD APIs for animal listings, user profiles, and messaging, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping two helpline/contact-detail update features to their target files (HelplinePage.tsx and Layout.tsx) with test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in the Pashu Mandi React app including styling, routing, hooks, and page components.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Pashu Mandi' and mounting the React root.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all app routes (home, post-ad, listing detail, messages, profile, signup, helpline) and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component that displays a conversation with a recipient, supports sending messages, auto-scrolls to the latest message, and shows date separators and loading skeletons.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header, responsive navigation links, and authentication handling via Internet Identity login/logout.",
  "frontend/src/components/ListingCard.tsx": "Card component for displaying an animal listing with photo, category badge, VIP styling, and formatted price; includes category label and color mappings.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for handling UPI payment flow for ad posting, supporting promo codes, VIP pricing, QR code display, and a two-step payment confirmation process.",
  "frontend/src/components/PhotoGallery.tsx": "Image gallery component with a main photo view, prev/next navigation arrows, thumbnail strip, and error fallback handling for broken images.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to set up their display name and bio, blocking dismissal until the profile is saved.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, listings, messages, and sign-up operations via the canister actor.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light and dark theme design tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HelplinePage.tsx": "A customer support page with a contact form that validates input and shows a success confirmation after submission.",
  "frontend/src/pages/HomePage.tsx": "The main browse page displaying animal listings with a hero banner, search/filter controls by category and location, and a featured VIP listings section.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single animal listing showing a photo gallery, price, metadata, seller profile, and a contact seller button that navigates to messaging.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a two-panel messaging UI with a conversation list sidebar and a chat thread view, requiring Internet Identity authentication. Auto-selects conversations from URL params or defaults to the first conversation in the list.",
  "frontend/src/pages/PostAdPage.tsx": "Form page for creating animal listings with title, description, price, category, location, and up to 5 photos, supporting an optional VIP upgrade via a payment modal. Requires authentication and an existing mobile number registration.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile with editable display name and bio, and lists their active listings with an option to deactivate each. Requires Internet Identity login to access.",
  "frontend/src/pages/SignUpPage.tsx": "Registration form that collects a full name and mobile number to create a new Pashu Mandi account, requiring the user to be logged in via Internet Identity first.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters from both standard and hash-based routing, persist them in sessionStorage, and remove sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and accordion animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Tracks the overall state of the 'Pashu Mandi' animal marketplace app, including project version, architectural notes, known issues, and a list of existing implemented features with their IDs and requirements."
}