{
  "backend/main.mo": "Main Motoko actor for the Pashu Mandi backend, defining data types (Listing, Message, UserProfile) and implementing CRUD endpoints for listings, user profiles, messaging, and admin approval/rejection workflows with role-based access control.",
  "feature_evidence.json": "Feature evidence report confirming that the header dark overlay requirement (bg-black/50 or bg-black/60) in Layout.tsx is implemented with high confidence, referencing test REQ-52.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their purpose, recent changes, and key implementation details for build planning reference.",
  "frontend/index.css": "Base CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite app, setting the page title to 'Pashu Mandi', linking the goat logo favicon, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, post-ad, listing detail, messages, profile, signup, helpline, terms, admin) and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/ChatThread.tsx": "Chat UI component displaying a conversation thread with sorted messages, date separators, three quick-reply buttons, auto-scroll, and a message input form using the sendMessage mutation.",
  "frontend/src/components/Layout.tsx": "App shell header component with a sticky header featuring an animal collage background image, a bg-black/70 dark overlay for text legibility, logo, desktop/mobile navigation links, auth button, and admin link when applicable.",
  "frontend/src/components/ListingCard.tsx": "Renders a card component for an animal listing with photo, category badge, VIP styling, and price formatting. Exports category label/color maps and a price formatter utility.",
  "frontend/src/components/PaymentModal.tsx": "A multi-step payment dialog for listing fees that supports UPI QR code display, promo code validation, and a confirmation step before submitting. Handles VIP vs regular pricing and an admin free code.",
  "frontend/src/components/PhotoGallery.tsx": "Displays a navigable photo gallery with a main image, prev/next arrows, thumbnail strip, and error fallback states for broken images.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking dialog that prompts new users to enter a display name and optional bio to create their profile before using the app.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, sign-up, listings (CRUD), messaging, and admin actions like approving/rejecting listings.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin page that displays pending listings with approve/reject actions, showing listing details like photo, category, location, and seller principal.",
  "frontend/src/pages/HelplinePage.tsx": "Customer support page with a contact form (name, order ID, issue) that shows a success state after submission and lists contact info.",
  "frontend/src/pages/HomePage.tsx": "Main browse page featuring a hero banner, search/filter controls by category and location, a VIP featured listings section, and a filtered grid of active listings.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single listing showing a photo gallery, price, category, location, description, seller profile, and a contact-seller button that navigates to messaging.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a two-panel messaging UI with a conversation list sidebar and a chat thread view, requiring Internet Identity authentication. Auto-selects conversations from URL params or defaults to the first conversation in the list.",
  "frontend/src/pages/PostAdPage.tsx": "Form page for creating animal listings with title, description, price, category, location, and up to 5 photos, supporting optional VIP promotion via a payment modal. Requires authentication and an existing mobile number on the user's profile.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile with editable display name and bio, and lists their active listings with an option to deactivate each. Redirects unauthenticated users to a login prompt.",
  "frontend/src/pages/SignUpPage.tsx": "Registration page that collects a full name and mobile number to create a new Pashu Mandi account, requiring prior Internet Identity login. Validates inputs and calls the signUp mutation on submission.",
  "frontend/src/pages/TermsPage.tsx": "Static page displaying Pashu Mandi's terms and conditions as a list of four cards covering honest information, no illegal trading, platform disclaimer, and admin rights.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters from both standard and hash-based routing, persist them in sessionStorage, and remove sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, Plus Jakarta Sans), OKLCH-based color tokens, border radii, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state document (version 41) describing 'Pashu Mandi', an animal marketplace app with features like ad posting with ₹199 fee, VIP listings, admin approval workflow, chat, and a Professional Blue theme; tracks existing features, architectural notes, and known issues."
}