{
  "backend/main.mo": "Main Motoko actor for the Animal Pashu Bazar backend, defining data types and CRUD operations for listings, user profiles, and messages, with role-based access control for admin and user actions like creating, approving, and rejecting listings.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (primarily z-index, pointer-events, and UI layering fixes in BottomNav, Layout, and HomePage components) to their source files, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their purpose, recent changes, and key implementation details for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes, including background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the Animal Pashu Bazar PWA, setting up viewport meta tags, PWA manifest link, theme color, Apple mobile web app tags, and mounting the React app via /src/main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for Animal Pashu Bazar, defining app name, display mode, theme/background colors, orientation, and icon assets for 64x64 and 128x128 sizes.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets and network-first for navigation, with explicit bypass rules for Internet Identity and ICP API endpoints to prevent interference with authentication.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all page routes and defines multiple route guard components (AuthGuard, AdminRouteGuard, CattleTrackerRouteGuard, etc.) to protect routes based on authentication and role checks.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with five tabs (Home, Chats, Sell, My Ads, Account), redirecting unauthenticated users to the signup page for protected routes. The Sell button is styled as a prominent floating action button with a gold ring and blue inner circle.",
  "frontend/src/components/ChatThread.tsx": "Displays a real-time chat thread between the current user and a recipient, supporting message sending, quick replies, and auto-scroll to the latest message. Fetches conversation history and recipient profile via custom query hooks.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a sticky header (logo, version badge, admin link), a bottom navigation bar, main content area, and a footer crediting caffeine.ai.",
  "frontend/src/components/ListingCard.tsx": "Renders a card for an animal listing with photo, category badge, price, and optional VIP gold styling. Exports category label and color maps along with a price formatter utility.",
  "frontend/src/components/LocationPickerModal.tsx": "A modal dialog for selecting an Indian state/location, supporting manual search through a predefined state list and automatic detection via the browser Geolocation API with reverse geocoding through Nominatim.",
  "frontend/src/components/PaymentModal.tsx": "A two-step payment modal for ad posting fees that displays a UPI QR code and ID, supports promo code discounts (including a free admin code), and handles VIP vs. regular pricing before confirming submission.",
  "frontend/src/components/PhotoGallery.tsx": "A React component that displays a photo gallery with a main image, prev/next navigation arrows, a photo counter, and clickable thumbnails. Handles image load errors by showing a fallback placeholder.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to create their profile by entering a display name and optional bio, then saves it via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage Internet Identity authentication state, including login, logout, and persisting identity across page reloads via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data, including listings, user profiles, and mobile numbers, each wired to the ICP actor from `useActor`.",
  "frontend/src/hooks/useWebShare.ts": "A hook that exposes a `share` function using the Web Share API with a clipboard fallback, showing toast notifications on success or failure.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, defines Tailwind CSS base/component/utility layers, sets light/dark CSS custom properties for the design system, and adds scrollbar and mobile tap-highlight styles.",
  "frontend/src/lib/utils.ts": "Exports a `cn` utility function that merges Tailwind CSS class names using `clsx` and `tailwind-merge`.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying app statistics, pending/all listings management, user activity, and mobile numbers, with approve/reject/delete actions for listings.",
  "frontend/src/pages/CattleTrackerPage.tsx": "Page that displays registered users with mobile numbers and all animal listings in tabular form, using admin-level queries to cross-reference user and listing data.",
  "frontend/src/pages/HelplinePage.tsx": "Help and support page showing contact phone numbers, email, a contact form, and menu items for FAQ, rating, inviting friends, and beta testing.",
  "frontend/src/pages/HomePage.tsx": "Main browse page with a hero banner, search/filter controls (category, location, text), VIP featured listings section, and a filtered grid of active animal listings.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single animal listing, showing a photo gallery, price, description, seller profile, and a contact-seller button that redirects unauthenticated users to sign up.",
  "frontend/src/pages/ManagementPage.tsx": "Admin management page that displays tables of registered users (with phone numbers) and all listings with status badges. Read-only view using admin query hooks.",
  "frontend/src/pages/MessagesPage.tsx": "Messaging page showing a two-panel layout with a conversation list sidebar and a chat thread view. Handles authentication gating, URL-based conversation selection, and auto-selects the first conversation.",
  "frontend/src/pages/OwnerViewPage.tsx": "Owner/admin view page similar to ManagementPage but adds an approve listing action button alongside the registered users and listings tables.",
  "frontend/src/pages/PostAdPage.tsx": "Multi-step form page (5 steps: details, photos, price, location, review) for creating a new animal listing, with photo upload, location picker modal, and payment modal for VIP ads.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying the authenticated user's info, menu items (packages, listings, wishlist, settings), and dialogs for editing profile details, viewing own ads, and logging out.",
  "frontend/src/pages/SignUpPage.tsx": "Multi-step sign-up page that handles Internet Identity login, then collects display name and mobile number to register a new user account via the `useSignUp` mutation.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page displaying four rules (honest info, no illegal trading, platform disclaimer, admin rights) as styled cards.",
  "frontend/src/pages/UserDashboardPage.tsx": "Authenticated user dashboard showing profile info with inline editing and the user's active listings, with options to deactivate listings or navigate to create new ones.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both regular and hash-based routes, with helpers to persist values in sessionStorage and clean sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, typography/display fonts, border radii, box shadows, and accordion animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 111) describing the Animal Pashu Bazar marketplace app's architecture, existing features, and known issues such as sign-up failures, admin dashboard visibility, and bottom nav z-index bugs."
}