{
  "backend/main.mo": "Main actor for the Pashu Mandi backend, implementing listings CRUD, user profiles, and messaging APIs with role-based access control and VIP listing support.",
  "backend/migration.mo": "Data migration module that upgrades existing listings from OldListing (without isVip) to NewListing by defaulting isVip to false.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (VIP ad checkbox, PaymentModal VIP fee, ListingCard VIP badge, Featured Animals section) to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference for the build plan.",
  "frontend/index.css": "Global CSS defining OKLCH-based design tokens for light and dark themes using Tailwind's base layer, with neutral/grayscale color variables.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Pashu Mandi' and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, post-ad, listing detail, messages, profile, signup) and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component that displays a sorted message history between two users with auto-scroll, date separators, and a message input form.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header containing logo, navigation links, and auth (login/logout) button, supporting both desktop and mobile (hamburger) menus using Internet Identity.",
  "frontend/src/components/ListingCard.tsx": "Card component for displaying an animal listing with photo, category badge, VIP styling, and formatted price; exports category label/color maps and a price formatter utility.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for collecting a UPI posting fee (regular or VIP), with promo code support, QR code display, UPI ID copy, and a two-step payment confirmation flow.",
  "frontend/src/components/PhotoGallery.tsx": "Image gallery component with a main photo view, prev/next navigation arrows, photo counter, and clickable thumbnails, handling broken images gracefully.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces new authenticated users to create a profile by entering a display name and optional bio before accessing the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, sign-up, listings, and messages using the actor and identity hooks.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS, and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a hero banner, search/filter controls, featured VIP listings, and a filterable grid of all active animal listings.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single listing showing a photo gallery, price, location, seller profile, and a button to contact the seller via messages.",
  "frontend/src/pages/MessagesPage.tsx": "Messaging page that shows a sidebar of conversations and a chat thread panel, requiring authentication and supporting direct navigation to a specific user's thread.",
  "frontend/src/pages/PostAdPage.tsx": "A form page for authenticated users to create animal listings with title, description, price, category, location, and up to 5 photos. Includes VIP listing option and triggers a payment modal before submitting to the backend.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile with editable display name and bio, and lists their active listings with an option to deactivate each one.",
  "frontend/src/pages/SignUpPage.tsx": "A sign-up form page that collects full name and mobile number for new users, requiring Internet Identity authentication before account creation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and animations for the app's design system.",
  "project_state.json": "Project state metadata describing Pashu Mandi, an animal marketplace app with listings, chat, user profiles, UPI-based ad posting fees, and VIP featured listings."
}