{
  "backend/main.mo": "Main Motoko actor for the Pashu Mandi backend, implementing listings CRUD, user profiles, and messaging with role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features recorded.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and notable recent changes.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom property tokens for light and dark themes covering background, foreground, primary, chart, and sidebar colors.",
  "frontend/index.html": "HTML shell entry point for the Vite/React app, setting the page title to 'Pashu Mandi' and mounting the React root.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, post-ad, listing detail, messages, profile, signup, helpline) and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component that displays a sorted message history between two users with date separators, auto-scroll, and a send-message form using React Query mutations.",
  "frontend/src/components/Layout.tsx": "App shell layout component providing a sticky primary-colored header with logo, desktop/mobile navigation links (including Helpline), auth login/logout button, and a footer with contact phone numbers.",
  "frontend/src/components/ListingCard.tsx": "Renders a card component for an animal listing with photo, category badge, VIP styling, and price formatting. Exports category label/color maps and a price formatter utility.",
  "frontend/src/components/PaymentModal.tsx": "A multi-step payment dialog for listing fees that supports UPI QR code display, promo code validation, and a confirmation step before submitting. Handles VIP vs. regular pricing and an admin free code.",
  "frontend/src/components/PhotoGallery.tsx": "Displays a navigable photo gallery with a main image, prev/next arrows, a counter, and clickable thumbnails. Handles image load errors with a fallback placeholder.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking modal dialog that prompts new users to enter a display name and optional bio to create their profile on first login.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and status tracking via DFINITY's AuthClient, exposed through a React context provider and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, sign-up, listings, and messages using the ICP actor and Internet Identity.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HelplinePage.tsx": "Customer support page with a contact form (name, order ID, issue) that validates input and shows a success state on submission.",
  "frontend/src/pages/HomePage.tsx": "Main browse page displaying animal listings with search, category, and location filters, plus a hero banner and a featured VIP listings section.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single listing showing a photo gallery, price, metadata, and a contact-seller button that navigates to the messages thread.",
  "frontend/src/pages/MessagesPage.tsx": "Messaging page that lists conversations in a sidebar and renders a ChatThread for the selected principal, requiring Internet Identity authentication.",
  "frontend/src/pages/PostAdPage.tsx": "A form page for authenticated users to create animal listings with title, description, price, category, location, and up to 5 photos. Includes VIP listing option, payment modal integration, and validation before submission.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile with editable display name and bio, and lists their active listings with an option to deactivate each one.",
  "frontend/src/pages/SignUpPage.tsx": "A sign-up form page that collects full name and mobile number for new users, requiring Internet Identity authentication before account creation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and animations for the app's design system.",
  "project_state.json": "Project state metadata describing Pashu Mandi, an animal marketplace app with listings, chat, payments (₹199 fee via UPI), VIP listings, and admin promo code features."
}