{
  "backend/main.mo": "Main Motoko actor for the Animal Pashu Bazar backend, defining data types and CRUD operations for listings, user profiles, and messages, with role-based access control for admin and user permissions.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their affected files, related components, test IDs, and confidence levels for three features: removing the invite banner, replacing the Account tab with Share in BottomNav, and updating the version label to 49.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and notable recent changes such as bug fixes, styling updates, and new exports.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the React SPA, setting the app title to 'Animal Pashu Bazar', linking the PWA manifest, and mounting the root React component.",
  "frontend/public/manifest.json": "PWA web app manifest for Animal Pashu Bazar, specifying the app name, standalone display mode, theme color, and icon assets.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets and network-first for navigation, while bypassing Internet Identity and ICP API endpoints entirely.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all app routes and implements role-based route guard components (Admin, Management, OwnerView, CattleTracker) that wait for identity initialization before redirecting.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with links to Home, Chats, Sell (post-ad), My Ads (dashboard), and a Share button that uses the Web Share API.",
  "frontend/src/components/ChatThread.tsx": "Chat thread component that displays a conversation with a recipient, supports sending messages, and provides quick-reply shortcuts for common animal marketplace questions.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping all pages with a sticky header (logo, privileged-role nav links, auth button), a mobile hamburger menu, and the BottomNav component.",
  "frontend/src/components/ListingCard.tsx": "Card component for displaying an animal listing with photo, category badge, VIP styling, price, and a link to the listing detail page.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for handling ad posting payments via UPI, supporting promo code discounts, a QR code display, and a two-step payment confirmation flow.",
  "frontend/src/components/PhotoGallery.tsx": "Image gallery component with a main photo view, previous/next navigation arrows, a photo counter, and a scrollable thumbnail strip with error fallback handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that prompts new users to set up their profile with a display name and optional bio, submitting via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using TanStack Query, initializing it with the user's identity (or anonymously) and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all TanStack Query hooks and mutations for the app, covering listings, user profiles, admin operations, and role-checking utilities against the ICP backend actor.",
  "frontend/src/hooks/useWebShare.ts": "A hook that exposes a `share` function using the Web Share API with a clipboard fallback, showing toast notifications on success or failure.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/src/lib/utils.ts": "Exports a `cn` utility function that merges Tailwind CSS class names using `clsx` and `tailwind-merge`.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/pages/AdminDashboardPage.tsx": "An admin dashboard page with tabbed views for app statistics, pending/all listings management, user activity, and mobile numbers, using admin-specific query hooks for data and mutations for approve/reject/delete actions.",
  "frontend/src/pages/CattleTrackerPage.tsx": "Admin page that displays registered users and all animal listings with status badges, prices, and category labels, fetched via admin query hooks.",
  "frontend/src/pages/HelplinePage.tsx": "Customer helpline page with a contact form (name, order ID, issue) that validates input and shows a success confirmation on submission.",
  "frontend/src/pages/HomePage.tsx": "Main browse page showing active animal listings with search, category, and location filters, plus a hero banner and a featured VIP listings section.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single animal listing showing a photo gallery, price, description, seller profile, and a contact-seller button that navigates to messages.",
  "frontend/src/pages/ManagementPage.tsx": "Admin management page displaying tables of registered users (with mobile numbers) and all listings with status badges, similar to CattleTrackerPage but without sorting logic.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a two-panel messaging UI with a conversation list sidebar and a chat thread view, requiring authentication and supporting URL-based conversation selection.",
  "frontend/src/pages/OwnerViewPage.tsx": "Admin dashboard page showing all registered users and all listings with their statuses, including the ability to approve pending listings.",
  "frontend/src/pages/PostAdPage.tsx": "Form page for creating a new animal listing with title, description, price, category, location, and up to 5 photos, with optional VIP promotion via a payment modal.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that allows authenticated users to view and edit their display name and bio, and manage (view/deactivate) their own listings.",
  "frontend/src/pages/SignUpPage.tsx": "Registration page that collects a display name and mobile number to create a new user account, with connection-readiness checks and error handling.",
  "frontend/src/pages/TermsPage.tsx": "Static page displaying the platform's terms and conditions as a list of four cards covering honesty, prohibited trading, disclaimers, and admin rights.",
  "frontend/src/pages/UserDashboardPage.tsx": "User dashboard page that displays and allows editing of the authenticated user's profile, and lists their active listings with an option to deactivate them. Redirects unauthenticated users to a login prompt.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and accordion animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Project state document describing the Animal Pashu Bazar marketplace app's architecture, features, known issues, and version history at state version 99."
}