{
  "backend/main.mo": "Main Motoko actor for the Pashu Mandi backend, defining data types (Listing, Message, UserProfile) and canister methods for creating/approving/rejecting listings, user profiles, messaging, and access control via admin/user roles.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (CattleTrackerRouteGuard fix, useIsCattleTrackerUser hook fix, Admin Panel nav button, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key changes made to components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Pashu Mandi React app, referencing the goat logo favicon, PWA manifest, and the main TSX module.",
  "frontend/public/manifest.json": "PWA web app manifest for Pashu Mandi, specifying app name, theme color, standalone display mode, and icon assets.",
  "frontend/public/sw.js": "Service worker implementing cache-first for static assets and network-first for navigation, with explicit bypass logic for Internet Identity and ICP API endpoints to avoid intercepting authentication flows.",
  "frontend/src/App.tsx": "Root React app with TanStack Router defining all routes and route guard components (Admin, Management, OwnerView, CattleTracker) that wait for both 'initializing' and 'logging-in' auth states before redirecting unauthorized users.",
  "frontend/src/components/ChatThread.tsx": "Renders a full chat thread UI between the current user and a recipient, supporting message display with timestamps, sending new messages, and quick-reply shortcuts via the messaging hooks.",
  "frontend/src/components/Layout.tsx": "Provides the app-wide layout shell with a sticky header, responsive navigation links, role-based nav items (admin, cattle tracker, management, owner), and Internet Identity login/logout handling.",
  "frontend/src/components/ListingCard.tsx": "Displays a single animal listing as a card with photo, category badge, VIP styling, price, and location, linking to the listing detail page.",
  "frontend/src/components/PaymentModal.tsx": "A multi-step modal for collecting UPI payment before posting an ad, supporting promo code validation, dynamic pricing for regular vs. VIP ads, QR code display, and a confirmation step.",
  "frontend/src/components/PhotoGallery.tsx": "Renders an image gallery with a main photo view, prev/next navigation arrows, a photo counter, and clickable thumbnails, with per-image error fallback handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking dialog shown to new users to collect a display name and optional bio, saving the profile via the useSaveCallerUserProfile hook before allowing app access.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend data fetching and mutations (listings, users, admin actions) as well as principal-based role-check hooks (admin, owner, cattle tracker, management).",
  "frontend/src/hooks/useWebShare.ts": "Hook that exposes a share function using the Web Share API with a clipboard fallback, showing toast notifications on copy success or failure.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility module exporting a cn helper that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for app statistics, pending/all listings management, user activity, and mobile numbers, supporting approve/reject/delete actions on listings.",
  "frontend/src/pages/CattleTrackerPage.tsx": "Cattle tracker page displaying registered users with mobile numbers and all animal listings in tabular form, with status badges and category labels, intended for a privileged tracker role.",
  "frontend/src/pages/HelplinePage.tsx": "Renders a customer helpline page with a hero section and a contact form (name, order ID, issue) that validates inputs and shows a success confirmation after submission.",
  "frontend/src/pages/HomePage.tsx": "Displays the main marketplace browse page with search, category, and location filters applied to active listings, plus a featured VIP section and an invite/share banner.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows the full detail view for a single animal listing including a photo gallery, price, metadata, seller profile, and a contact-seller button that navigates to the messages thread.",
  "frontend/src/pages/ManagementPage.tsx": "Admin management page that displays all registered users (with phone numbers) and all listings in tabular form, using admin-only query hooks and status/category badge helpers.",
  "frontend/src/pages/MessagesPage.tsx": "Authenticated messaging page that lists all conversations in a sidebar and renders the selected chat thread, with support for deep-linking to a specific principal via the URL path.",
  "frontend/src/pages/OwnerViewPage.tsx": "Admin-only page that displays all registered users and all listings with their statuses, allowing the admin to approve pending listings via a table-based UI.",
  "frontend/src/pages/PostAdPage.tsx": "Page for authenticated users to create a new animal listing with title, description, price, category, location, and up to 5 photos, with optional VIP promotion via a payment modal.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that lets authenticated users view and edit their display name/bio and manage (deactivate) their active listings.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page where Internet Identity-authenticated users register by providing a display name and mobile number to create their Pashu Mandi account.",
  "frontend/src/pages/TermsPage.tsx": "Static page displaying Pashu Mandi's terms and conditions covering honest information, prohibited activities, platform disclaimer, and admin rights.",
  "frontend/src/pages/UserDashboardPage.tsx": "User dashboard page that shows the authenticated user's profile (with inline editing) and their active listings, with the ability to deactivate individual listings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palette, extended typography/border/shadow tokens, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state descriptor for 'Pashu Mandi', a livestock/pet marketplace app, documenting architecture, features, known issues (auth, admin panel, routing), and business rules like payment flow and admin promo codes."
}