{
  "kind": "build_request",
  "title": "VIP Ads with Featured Animals Section",
  "projectName": "Pashu Mandi",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Extend the backend listing data model to add a boolean `isVip` field to each listing record (defaulting to `false`). Update the `createListing` function to accept an `isVip` parameter. VIP listings must be persisted with this flag. Add or update a `getListings` / `getAllListings` query so that VIP listings are returned first (sorted to the top), followed by non-VIP listings sorted by creation timestamp descending.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "VIP Ads should have a 'Verified' badge and a gold border to look premium.",
          "Ensure these VIP ads stay at the top of the list for better visibility to buyers"
        ]
      },
      "acceptanceCriteria": [
        "The listing record type includes an `isVip : Bool` field.",
        "createListing accepts an `isVip` parameter and stores it correctly.",
        "Querying all listings returns VIP listings before non-VIP listings.",
        "Non-VIP listings remain sorted by timestamp descending after VIP ones."
      ]
    },
    {
      "id": "REQ-23",
      "text": "In PostAdPage, add a clearly labelled checkbox or toggle option reading 'Make this a VIP Ad (₹500)' below the existing form fields. When this option is selected, set a `isVip` flag in the form state. Pass this flag through to the PaymentModal so the payment modal can display the correct fee (₹500 for VIP ads, ₹199 for regular ads). The VIP option must be styled consistently with the Professional Blue theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "In the 'Post Ad' form, add an option: 'Make this a VIP Ad (₹500)'."
        ]
      },
      "acceptanceCriteria": [
        "A 'Make this a VIP Ad (₹500)' checkbox/toggle is visible in the Post Ad form.",
        "Selecting it updates the form's isVip state to true.",
        "The PaymentModal receives the isVip flag and displays ₹500 as the posting fee when isVip is true.",
        "When isVip is false, the modal continues to show ₹199 as before.",
        "The isVip value is passed to the createListing backend call on payment confirmation."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update PaymentModal to accept and display the correct posting fee based on whether the listing is a VIP Ad. When isVip is true, display 'Posting Fee: ₹500' and update the UPI QR code amount to ₹500. When isVip is false, retain the existing ₹199 flow. The promo code discount feature should only apply to non-VIP ads (disable promo code input when isVip is true, or show a note that promo codes are not applicable for VIP Ads).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "In the 'Post Ad' form, add an option: 'Make this a VIP Ad (₹500)'."
        ]
      },
      "acceptanceCriteria": [
        "PaymentModal shows 'Posting Fee: ₹500' when isVip is true.",
        "PaymentModal shows 'Posting Fee: ₹199' when isVip is false.",
        "UPI QR code encodes ₹500 for VIP ads and ₹199 for regular ads.",
        "Promo code input is hidden or disabled for VIP ads with an appropriate note.",
        "Existing promo code flow is unchanged for non-VIP ads."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update ListingCard to visually distinguish VIP listings: render a gold border (e.g. border-yellow-400 or equivalent) around the card and display a 'Verified' badge (gold background, white or dark text) prominently on the card (e.g. top-left or top-right corner overlay) when the listing's `isVip` field is true. Non-VIP cards must remain visually unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "VIP Ads should have a 'Verified' badge and a gold border to look premium."
        ]
      },
      "acceptanceCriteria": [
        "VIP listing cards have a visible gold/amber border distinguishing them from regular cards.",
        "A 'Verified' badge with gold styling is shown on VIP listing cards.",
        "Non-VIP listing cards are visually unchanged.",
        "The badge is clearly legible and does not obscure the listing photo or title."
      ]
    },
    {
      "id": "REQ-26",
      "text": "On the HomePage, add a 'Featured Animals' section above the main listings grid. This section displays only VIP listings (isVip === true) as a horizontally scrollable row or a small dedicated grid. The section must have a prominent heading 'Featured Animals' styled with a gold accent (e.g. a gold star icon or gold underline). If there are no VIP listings, this section should be hidden entirely. The main listings grid below continues to show all active listings (VIP first, then regular), unchanged in layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Create a special section on the Home Screen labeled 'Featured Animals' that shows premium listings at the top.",
          "Ensure these VIP ads stay at the top of the list for better visibility to buyers"
        ]
      },
      "acceptanceCriteria": [
        "A 'Featured Animals' section heading is visible at the top of the home page when VIP listings exist.",
        "Only VIP listings appear in the Featured Animals section.",
        "The section is hidden when there are no VIP listings.",
        "The Featured Animals section uses a gold accent on the heading (icon or decorative element).",
        "The main listings grid below still shows all listings with VIP ones sorted to the top.",
        "Featured Animals cards display the gold border and 'Verified' badge from REQ-25."
      ]
    }
  ],
  "constraints": [
    "Do not change the existing PaymentModal promo code flow for non-VIP ads.",
    "VIP ad sorting must be handled at the backend query level, not only client-side.",
    "The gold border and Verified badge styling must not break the existing card layout or obscure listing information."
  ],
  "nonGoals": [
    "Automatic verification or admin approval of VIP listings.",
    "Separate VIP-only page or route.",
    "Recurring or subscription-based VIP pricing.",
    "Promo codes applicable to VIP Ads."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}