{
  "kind": "build_request",
  "title": "Fix Bottom Nav Z-Index & Pointer Events (Version 55)",
  "projectName": "Animal Pashu Bazar",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-184",
      "text": "In frontend/src/components/BottomNav.tsx, set z-index: 999 (e.g., Tailwind class z-[999]) on the bottom navigation bar's root container element so it renders above all other page content, overlays, and background elements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Set a high z-index: 999 for all buttons in the Bottom Navigation Bar and the 'Sell' button."
        ]
      },
      "acceptanceCriteria": [
        "The bottom navigation bar's root container has z-index 999 or higher.",
        "The bar is visually rendered on top of all page content and background layers."
      ]
    },
    {
      "id": "REQ-185",
      "text": "In frontend/src/components/BottomNav.tsx, explicitly set pointer-events: auto and position: relative (or ensure no override) on each of the five tab buttons — Home, Chats, Sell, My Ads, and Account — so that all tap/click interactions are reliably received regardless of overlapping layers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ensure the 'Account', 'My Ads', and 'Chats' buttons have pointer-events: auto and are not covered by any other element."
        ]
      },
      "acceptanceCriteria": [
        "Clicking/tapping the Home, Chats, Sell, My Ads, and Account tabs all trigger their respective navigation actions.",
        "No tab button is blocked by an overlapping element."
      ]
    },
    {
      "id": "REQ-186",
      "text": "In frontend/src/components/BottomNav.tsx, apply z-index: 999 and isolation: isolate to the floating circular 'Sell' button specifically, ensuring it also floats above all other elements and receives pointer events correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Set a high z-index: 999 for all buttons in the Bottom Navigation Bar and the 'Sell' button."
        ]
      },
      "acceptanceCriteria": [
        "The Sell button has z-index 999 and is clickable.",
        "The Sell button visually floats above the navigation bar without being obscured."
      ]
    },
    {
      "id": "REQ-187",
      "text": "In frontend/src/components/Layout.tsx and frontend/src/pages/HomePage.tsx, audit all decorative background containers (including any hero image containers, header background layers, and any full-viewport overlay divs). Apply pointer-events: none (Tailwind: pointer-events-none) to every purely decorative or background-layer element so they cannot intercept clicks intended for interactive elements beneath or above them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ensure that the tiger background or any transparent containers are set to pointer-events: none so they don't block clicks."
        ]
      },
      "acceptanceCriteria": [
        "Decorative background/overlay divs in Layout.tsx and HomePage.tsx have pointer-events: none.",
        "No background layer intercepts clicks on the bottom navigation bar or other interactive elements."
      ]
    },
    {
      "id": "REQ-188",
      "text": "Audit all page-level components (HomePage.tsx, PostAdPage.tsx, ListingDetailPage.tsx, MessagesPage.tsx, ProfilePage.tsx, UserDashboardPage.tsx, SignUpPage.tsx, and any other pages that render behind the bottom nav bar) for any full-width/full-height containers that may inadvertently have pointer-events enabled and are stacked at a z-index that overlaps the bottom nav bar. Add pointer-events: none to any such decorative containers and ensure the page content wrapper does not exceed the viewport in a way that causes z-index conflicts with the bottom nav.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Clear Overlays: Ensure that the tiger background or any transparent containers are set to pointer-events: none so they don't block clicks."
        ]
      },
      "acceptanceCriteria": [
        "On every page, all five bottom nav tabs are tappable without interference from page content layers.",
        "No full-height page container has a z-index that competes with z-[999] on the bottom nav."
      ]
    },
    {
      "id": "REQ-189",
      "text": "Verify that the 'Actor not available' comprehensive fix implemented in previous versions (polling for actor availability for up to 3 seconds, throwing 'Connection not ready. Please wait a moment and try again.' if unavailable, and the CattleTrackerRouteGuard reading the principal directly from identity?.getPrincipal().toText()) is still intact and active in frontend/src/hooks/useActor.ts, frontend/src/hooks/useQueries.ts, frontend/src/pages/SignUpPage.tsx, and frontend/src/App.tsx. If any regression is detected, re-apply the fix. No backend changes are required.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Backend Sync: Confirm the 'Actor not available' fix is active so buttons that trigger database actions (like login or post) work correctly."
        ]
      },
      "acceptanceCriteria": [
        "The useSignUp mutation polls for actor availability and does not throw 'Actor not available' during normal operation.",
        "The SignUpPage 'Create Account' button is disabled with 'Connecting...' label while the actor is initializing.",
        "The CattleTrackerRouteGuard reads principal from the identity context directly, not from an async backend query.",
        "The AdminRouteGuard shows a loading spinner while isAdmin is loading and only redirects when loading is complete."
      ]
    },
    {
      "id": "REQ-190",
      "text": "Update the visible version label displayed in the app to 'Version 55'. Find the version string wherever it appears in the footer, header, or any other visible UI element within Layout.tsx or any page component and update it to read 'Version 55'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Update Version: Push this fix as Version 55."
        ]
      },
      "acceptanceCriteria": [
        "The version label reads 'Version 55' wherever it appears in the app UI.",
        "No other version strings ('Version 54' or earlier) remain visible."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths.",
    "Do not change the backend schema or any Motoko files.",
    "Do not alter the visual layout, tab order, or styling of the bottom navigation bar beyond the z-index and pointer-events fixes.",
    "The five bottom nav tabs (Home, Chats, Sell, My Ads, Account) must remain in their current order and styling."
  ],
  "nonGoals": [
    "Adding new navigation tabs or changing tab routes.",
    "Redesigning any page layout beyond fixing pointer-events and z-index.",
    "Any backend changes.",
    "Changing the app branding, logo, or color scheme."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}