{
  "kind": "build_request",
  "title": "Add dark overlay to header background image for text legibility",
  "projectName": "Pashu Mandi",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-52",
      "text": "In frontend/src/components/Layout.tsx, ensure the header has a sufficiently dark semi-transparent overlay applied over the background image (e.g. bg-black/50 or bg-black/60) so that the 'Pashu Mandi' brand text and all navigation links are clearly and easily readable. The overlay must be dark enough to provide strong contrast against white/light text. The header layout, height, logo, navigation links, and all other header elements must remain structurally unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a dark overlay to the header image so the text 'Pashu Mandi' is easily readable"
        ]
      },
      "acceptanceCriteria": [
        "A dark semi-transparent overlay (e.g. bg-black/50 or darker) is applied over the header background image in Layout.tsx.",
        "The 'Pashu Mandi' brand text is clearly legible (high contrast white text) against the overlaid header image.",
        "All navigation links in the header remain clearly readable over the overlay.",
        "The header layout, height, logo, navigation links, and all other structural elements are unchanged.",
        "The overlay does not obscure interactive elements (links, buttons remain clickable)."
      ]
    }
  ],
  "constraints": [
    "Do not change the header background image asset (frontend/public/assets/generated/header-bg.dim_1200x300.png).",
    "Do not alter the header layout, height, logo, or navigation link structure.",
    "frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui are read-only and must not be modified."
  ],
  "nonGoals": [
    "Replacing or regenerating the header background image.",
    "Changing any other page styles or components outside of Layout.tsx.",
    "Modifying backend logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}