{
  "kind": "build_request",
  "title": "OLX-style home screen redesign: remove invite banner, replace Account tab with Share tab, update to Version 49",
  "projectName": "Animal Pashu Bazar",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-158",
      "text": "In frontend/src/pages/HomePage.tsx, remove the 'Invite a friend and help grow our community!' informational banner section entirely (including the Share/Invite button and its container). The rest of the HomePage layout, sections (hero, Featured Animals, listings grid, filters), and functionality must remain structurally unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Remove the large 'Invite a friend' share box from the middle of the screen."
        ]
      },
      "acceptanceCriteria": [
        "The 'Invite a friend and help grow our community!' banner is no longer rendered anywhere on the HomePage.",
        "No share/invite button or banner container appears between the hero section and the Featured Animals section.",
        "All other HomePage sections (hero, Featured Animals, listings grid, search/filter controls) remain intact and functional."
      ]
    },
    {
      "id": "REQ-159",
      "text": "In frontend/src/components/BottomNav.tsx, replace the current fifth tab ('Account') with a 'Share' tab. The Share tab must display an appropriate share/invite icon (e.g., a share or forward arrow icon) and the label 'Share'. The updated Bottom Navigation Bar must have exactly five tabs in this order: 'Home' (routes to '/'), 'Chats' (routes to '/messages'), 'Sell' (routes to '/post-ad', styled prominently as the center raised button), 'My Ads' (routes to '/dashboard' for authenticated users), and 'Share' (triggers the Web Share API or clipboard fallback using the existing useWebShare hook). The bottom bar must retain the clean white background and Professional Blue active-state indicator styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Add a small 'Share' or 'Invite' icon to the existing Bottom Navigation Bar.",
          "Ensure the Bottom Bar now has: Home, Chats, Sell (+), My Ads, and Share."
        ]
      },
      "acceptanceCriteria": [
        "The Bottom Navigation Bar contains exactly five tabs: Home, Chats, Sell, My Ads, and Share.",
        "The 'Account' tab is no longer present in the Bottom Navigation Bar.",
        "The 'Share' tab displays a recognizable share/invite icon and the label 'Share'.",
        "Clicking the 'Share' tab invokes the Web Share API (navigator.share) with the app name, invite text, and the app's root URL; falls back to clipboard copy with a toast notification if navigator.share is unavailable.",
        "The 'Sell' tab remains styled prominently (raised or highlighted center button) and routes to '/post-ad'.",
        "The 'Home', 'Chats', and 'My Ads' tabs remain functional and route to their respective pages.",
        "The active tab is highlighted with the Professional Blue active-state indicator.",
        "The bottom bar retains the clean white background and is fixed to the bottom of the viewport on all pages."
      ]
    },
    {
      "id": "REQ-160",
      "text": "Update the visible version label displayed in the app to 'Version 49'. Find the version string wherever it appears in the footer, header, or any other visible UI element within Layout.tsx or any page component and update it to read 'Version 49'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Keep the theme clean white and update to Version 49."
        ]
      },
      "acceptanceCriteria": [
        "The version label reads 'Version 49' wherever it is displayed in the app UI.",
        "No other visible version string remains showing a different version number."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths.",
    "The Web Share functionality in the Share tab must reuse the existing useWebShare hook logic.",
    "The Bottom Navigation Bar must remain visible on all pages, fixed to the bottom of the viewport.",
    "All other HomePage sections and functionality must remain unchanged after removing the invite banner.",
    "The overall Professional Blue and white clean theme must remain unchanged."
  ],
  "nonGoals": [
    "No changes to the backend.",
    "No changes to the 'Account' routing logic for other parts of the app beyond the BottomNav tab replacement.",
    "No redesign of any page other than removing the invite banner from HomePage and updating BottomNav.",
    "No changes to admin/owner-specific privileged navigation links in the header."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}