{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add dark overlay to header background image for text legibility",
  "requirements": [
    {
      "id": "REQ-52",
      "summary": "Apply a dark semi-transparent overlay (bg-black/50 or darker) over the header background image in Layout.tsx to ensure the 'Pashu Mandi' brand text and all navigation links are clearly readable with high contrast, while preserving all existing header layout, structure, and interactive elements",
      "acceptanceCriteria": [
        "A dark semi-transparent overlay (e.g. bg-black/50 or darker) is applied over the header background image in Layout.tsx.",
        "The 'Pashu Mandi' brand text is clearly legible (high contrast white text) against the overlaid header image.",
        "All navigation links in the header remain clearly readable over the overlay.",
        "The header layout, height, logo, navigation links, and all other structural elements are unchanged.",
        "The overlay does not obscure interactive elements (links, buttons remain clickable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add or strengthen the dark semi-transparent overlay on the header background image. Locate the header element that uses the background image at frontend/public/assets/generated/header-bg.dim_1200x300.png and ensure it has a child element (typically a div) with a dark overlay class such as 'bg-black/50' or 'bg-black/60' applied. The overlay must be positioned to cover the background image without interfering with the z-index stacking of text and navigation elements. Verify that the 'Pashu Mandi' logo/text and all navigation links remain fully interactive and clearly visible with high contrast against the darkened background. Do not alter the header's layout, dimensions, logo, navigation structure, or any other elements beyond the overlay styling."
        }
      ]
    }
  ]
}