{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "OLX-style home screen redesign: remove invite banner, replace Account tab with Share tab, update to Version 49",
  "requirements": [
    {
      "id": "REQ-158",
      "summary": "Remove the 'Invite a friend and help grow our community!' informational banner section entirely from HomePage, including the Share/Invite button and its container, while keeping all other sections intact",
      "acceptanceCriteria": [
        "The 'Invite a friend and help grow our community!' banner is no longer rendered anywhere on the HomePage.",
        "No share/invite button or banner container appears between the hero section and the Featured Animals section.",
        "All other HomePage sections (hero, Featured Animals, listings grid, search/filter controls) remain intact and functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Remove the invite/share banner section (the div containing 'Invite a friend and help grow our community!' text, Share/Invite button, and its container) from the HomePage component. Locate the banner between the hero section and Featured Animals section, and delete the entire banner container div including all its children. Ensure the remaining layout (hero section, Featured Animals section, search/filter controls, listings grid) remains structurally unchanged and properly spaced."
        }
      ]
    },
    {
      "id": "REQ-159",
      "summary": "Replace the 'Account' tab with a 'Share' tab in BottomNav, displaying a share icon and label, triggering the Web Share API or clipboard fallback using the existing useWebShare hook",
      "acceptanceCriteria": [
        "The Bottom Navigation Bar contains exactly five tabs: Home, Chats, Sell, My Ads, and Share.",
        "The 'Account' tab is no longer present in the Bottom Navigation Bar.",
        "The 'Share' tab displays a recognizable share/invite icon and the label 'Share'.",
        "Clicking the 'Share' tab invokes the Web Share API (navigator.share) with the app name, invite text, and the app's root URL; falls back to clipboard copy with a toast notification if navigator.share is unavailable.",
        "The 'Sell' tab remains styled prominently (raised or highlighted center button) and routes to '/post-ad'.",
        "The 'Home', 'Chats', and 'My Ads' tabs remain functional and route to their respective pages.",
        "The active tab is highlighted with the Professional Blue active-state indicator.",
        "The bottom bar retains the clean white background and is fixed to the bottom of the viewport on all pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Replace the fifth tab (currently 'Account') with a 'Share' tab. Import the useWebShare hook from '../hooks/useWebShare'. Change the Account tab definition to use a share icon (e.g., Share2, ExternalLink, or Forward icon from lucide-react) and the label 'Share'. Replace the Account tab's onClick handler to call the share function from useWebShare with parameters: title 'Animal Pashu Bazar', text 'Join me on Animal Pashu Bazar - buy and sell animals easily!', and url as the app's root URL (window.location.origin). Remove the Account tab's routing logic (to '/profile' or '/signup'). Ensure the updated tab array maintains the exact order: Home (/), Chats (/messages), Sell (/post-ad), My Ads (/dashboard), Share (share action). Verify the share function is called correctly and the existing Web Share API / clipboard fallback logic from useWebShare is triggered. Retain all existing styling for the bottom bar (white background, Professional Blue active indicator, fixed positioning)."
        }
      ]
    },
    {
      "id": "REQ-160",
      "summary": "Update the visible version label displayed in the app to 'Version 49'",
      "acceptanceCriteria": [
        "The version label reads 'Version 49' wherever it is displayed in the app UI.",
        "No other visible version string remains showing a different version number."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Locate the version string currently displayed in the Layout component (likely in the footer, header, or a visible UI element). Update the version text to read 'Version 49'. Search for any hardcoded version strings (e.g., 'Version 48', 'v48', or similar patterns) and replace with 'Version 49'. Ensure the updated version label is visible in the rendered UI and no other version strings remain."
        }
      ]
    }
  ]
}